import math

a = int(input("Введите коэффицент а " ))
b = int(input("Введите коэффицент b " ))
c = int(input("Введите коэффицент с " ))

if int((b*b-4*a*c) < 0):
    print('Корней нет!')
else:
    d = math.sqrt(b*b-4*a*c)
    if d > 0:
        x1 = (-1 * b + d) / (a * 2)
        x2 = (-1 * b - d) / (a * 2)
        print('1 корень уравнения = ', x1, '\n2 корень уравнения = ',x2, '\nДискриминант = ', d)
    else:
        x1 = (-1 * b)/ (a * 2)
        print('Ваше уравнение имеет только один корень = ',x1)


